Tekla Open API Reference for Tekla Structures 2025
Assembly.Add Method (ArrayList)
 Adds an array list of given assemblable instances to the assembly. For assemblies use Add(Assembly Assembly). Notice that adding other than assembly instances will actually assume that you are adding objects to a cast unit assembly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Add(
	ArrayList Assemblables
)
Public Function Add (
	Assemblables As ArrayList
) As Boolean
Parameters
Assemblables
Type: System.Collections.ArrayList
A list of assemblables to add to the assembly.
Return Value
Type: Boolean
True on success, otherwise false.
See Also
Reference
Assembly Class
Add Overload
Tekla.Structures.Model Namespace